Repository: Zensonaton/FlutterVK
Catalog: lib/l10n/app_*.arb
Languages: ru

# use_player_colors_appwide_desc
source: After enabling this setting, colors of the playing track cover will be shown throughout the app.
ru: Если включить эту настройку, то цвета обложки играющего трека будут показаны не только в плеере снизу, но и по всему приложению.

# enable_player_colors_appwide
source: Allow track colors app-wide
ru: Разрешить использование цветов трека по всему приложению

# player_dynamic_color_scheme_type
source: Cover color palette type
ru: Тип палитры цветов обложки

# player_dynamic_color_scheme_type_desc
source: This setting specifies how bright the color palette will be displayed in the player during music playback.
ru: Эта настройка диктует то, насколько яркими будут отображаться цвета в плеере снизу при воспроизведнии музыки. Данная настройка так же может работать с настройкой «Цвета трека по всему приложению», благодаря чему весь интерфейс приложения может меняться, в зависимости от цветов обложки трека, а так же яркости, указанной здесь.

# player_dynamic_color_scheme_type_tonalSpot
source: Default
ru: По-умолчанию

# player_dynamic_color_scheme_type_neutral
source: Neutral
ru: Нейтральный

# player_dynamic_color_scheme_type_content
source: Bright
ru: Яркий

# player_dynamic_color_scheme_type_monochrome
source: Monochrome
ru: Монохромный

source: Alternate slider
ru: Альтернативный слайдер

# alternate_slider_desc
source: Determines slider position for displaying track playback progress in the bottom player.
ru: Определяет то, где будет располагаться слайдер («полосочка») для отображения прогресса вопроизведения трека в мини-плеере снизу: над плеером, либо внутри.

# enable_alternate_slider
source: Move slider above player
ru: Переместить слайдер над плеером

# use_track_thumb_as_player_background
source: Track image as fullscreen player background
ru: Изображение трека как фон полноэкранного плеера

# spoiler_next_audio
source: Spoiler next track
ru: Спойлер следующего трека

# spoiler_next_audio_desc
source: This setting indicates whether the title of the next track will be displayed before finishing the current one.
ru: Данная настройка указывает то, будет ли отображено название для следующего трека перед тем, как закончить воспроизведение текущего. Название трека отображается над мини-плеером снизу. Дополнительно, Вы можете включить настройку «Кроссфейд цветов плеера», что сделает плавный переход цветов плеера перед началом следующего трека.

# enable_spoiler_next_audio
source: Show next track
ru: Показывать следующий трек

# crossfade_audio_colors
source: Player color crossfade
ru: Кроссфейд цветов плеера

# crossfade_audio_colors_desc
source: Makes a smooth transition of player colors before the next track starts.
ru: Определяет, будет ли происходить плавный переход между цветами текущего трекам, а так же цветов последующего прямо перед началом следующего.

# show_audio_thumbs
source: Show covers
ru: Отображение обложек

# show_audio_thumbs_desc
source: This setting indicates whether music thumbnails will be shown. Changes to this setting won''t affect the player.
ru: Если включить эту настройку, то приложение будет отображать обложки треков в плейлистах. Изменения данной настройки не затрагивают мини-плеер, располагаемый снизу.

# enable_show_audio_thumbs
source: Show track covers
ru: Включить отображение обложек треков

source: Music player
ru: Музыкальный плеер

source: Track title in window bar
ru: Название трека в заголовке окна

# close_action
source: Action on window close
ru: Действие при закрытии

# close_action_desc
source: Determines whether the app will actually close when the window is closed
ru: Определяет, закроется ли приложение при закрытии окна

# close_action_close
source: Close
ru: Закрыться

# close_action_minimize
source: Minimize
ru: Свернуться

# close_action_minimize_if_playing
source: Minimize if music is playing
ru: Свернуться, если играет музыка

# android_keep_playing_on_close
source: Playback after swiping
ru: Игра после смахивания приложения

# android_keep_playing_on_close_desc
source: Determines whether playback will continue after closing the app in the list of open apps on Android
ru: Определяет, продолжится ли воспроизведение после закрытия приложения в списке открытых приложений на Android

source: Shuffle on play
ru: Перемешка при воспроизведении

# shuffle_on_play_desc
source: Shuffles tracks in the playlist when playback starts
ru: Перемешивает треки в плейлисте при запуске воспроизведения

# profile_pauseOnMuteTitle
source: Pause on silent volume
ru: Пауза при минимальной громкости

# profile_pauseOnMuteDescription
source: Playback will pause when the volume is set to minimum
ru: Поставив громкость на минимум, воспроизведение приостановится

# stop_on_long_pause
source: Stop on inactivity
ru: Остановка при неактивности

# stop_on_long_pause_desc
source: The player will stop playing after a long pause, potentially saving battery life and device resources
ru: Плеер перестанет играть при долгой паузе, экономя ресурсы устройства

# rewind_on_previous
source: Rewind on previous track
ru: Перемотка при запуске предыдущего трека

# rewind_on_previous_desc
source: In which cases an attempt to start the previous track will rewind to the beginning instead of starting the previous track. A repeated attempt to rewind within a short time will start the previous track regardless of the setting value
ru: В каких случаях попытка запуска предыдущего трека будет перематывать в начало вместо запуска предыдущего. Повторная попытка перемотки в течении небольшого времени запустит предыдущий трек вне зависимости от значения настройки

# rewind_on_previous_always
source: Always
ru: Всегда

# rewind_on_previous_only_via_ui
source: Only via UI
ru: Только через интерфейс

# rewind_on_previous_only_via_notification
source: Only via notification/headphones
ru: Только через уведомление/наушники

# rewind_on_previous_only_via_disabled
source: Never
ru: Никогда

# check_for_duplicates
source: Duplicate prevention
ru: Защита от создания дубликатов

# check_for_duplicates_desc
source: You will see a warning that the track is already liked to avoid saving it twice
ru: Вы увидите предупреждение о том, что трек уже лайкнут, чтобы не сохранить его дважды

# track_duplicate_found_title
source: Duplicate found
ru: Обнаружен дубликат трека

# track_duplicate_found_desc
source: It looks like this track is already saved. Saving this track will create another copy of it. Are you sure you want to create a duplicate of this track?
ru: Похоже, что этот трек уже лайкнут Вами. Сохранив этот трек, у Вас будет ещё одна копия этого трека. Вы уверены, что хотите сделать дубликат данного трека?

# discord_rpc_desc
source: Broadcasts the playing track in Discord
ru: Транслирует играющий трек в Discord

# player_debug_logging
source: Debug player logging
ru: Debug-логирование плеера

# player_debug_logging_desc
source: Enables output of technical data of the music player to the log. This option is intended for debugging purposes and is not recommended for regular use. Usage of this option may lead to performance issues.
ru: Включает вывод технических данных музыкального плеера в лог. Включение настройки приведёт к понижению производительности приложения

# experimental_options
source: Experimental features
ru: Экспериментальные функции

# deezer_thumbnails
source: Deezer covers
ru: Обложки Deezer

# deezer_thumbnails_desc
source: Downloads covers for tracks from Deezer if the track does not have one. Sometimes may provide incorrect/low-quality covers
ru: Загружает обложки для треков из Deezer, если у трека её нет. Иногда может выдавать неправильные обложки

# lrclib_lyrics
source: Lyrics via LRCLIB
ru: Тексты песен через LRCLIB

# lrclib_lyrics_desc
source: Downloads lyrics from LRCLIB if the track does not have them or they are not synchronized. Sometimes may provide incorrect/low-quality lyrics
ru: Загружает тексты песен из LRCLIB, если у трека его нет, либо он не синхронизирован. Иногда может выдавать неправильные/некачественные тексты

# apple_music_animated_covers
source: Animated covers from Apple Music
ru: Анимированные обложки Apple Music

# apple_music_animated_covers_desc
source: Downloads animated covers for tracks from Apple Music if the track does not have one. Sometimes may provide incorrect/low-quality covers
ru: Включает возможность получения анимированных обложек из Apple Music, отображаемых в полноэкранном плеере. Работает у небольшого количества треков. Иногда может выдавать неправильные обложки

source: Volume normalization
ru: Нормализация громкости

# volume_normalization_desc
source: Automatically adjusts the volume of tracks to a consistent level
ru: Автоматически изменяет громкость треков, чтобы их уровень громкости был схож друг с другом

# volume_normalization_dialog_desc
source: "Normal" and "loud" setting values may cause distortion in some tracks.
ru: При значениях «средне» или «громко» может происходить искажение звука.

# volume_normalization_disabled
source: Disabled
ru: Выключено

# volume_normalization_quiet
source: Quiet
ru: Тихо

# volume_normalization_normal
source: Normal
ru: Средне

# volume_normalization_loud
source: Loud
ru: Громко

source: Silence removal
ru: Устранение тишины

# silence_removal_desc
source: Removes silence from beginning and end of audio tracks
ru: Избавляется от тишины в начале и конце трека

source: App settings
ru: Настройки приложения

source: Export settings
ru: Экспорт настроек

# export_settings_desc
source: Saves local track changes and app settings to a file to restore them on another device
ru: Сохраняет локальные изменения треков (обложки и прочие), а так же настроек приложения в файл, чтобы восстановить их на другом устройстве

source: Import settings
ru: Импорт настроек

# import_settings_desc
source: Loads a file previously created using "export settings"
ru: Загружает файл, ранее созданный при помощи «экспорта настроек»

# export_music_list
source: Export track list
ru: Экспорт списка треков

# export_music_list_desc
source: List of {count, plural, one{{count} liked track} other{{count} liked tracks}}:
ru: Список из {count, plural, one{{count} лайкнутого трека} other{{count} лайкнутых треков}}:

# export_settings_title
source: Export settings
ru: Экспорт настроек

# export_settings_tip
source: About settings export
ru: Об экспорте настроек

# export_settings_tip_desc
source: Settings export is a feature that allows you to save app and track settings to a special file for manual transfer to another device. After exporting, you will need to transfer the file to another device and use the <importSettings><importSettingsIcon></importSettingsIcon> Import settings</importSettings> feature to load the changes.
ru: Экспорт настроек — функция, которая позволяет сохранить настройки приложения и треков в специальный файл для ручного переноса на другое устройство. После экспорта Вам будет нужно перенести файл на другое устройство и воспользоваться функцией <importSettings><importSettingsIcon></importSettingsIcon> Импорт настроек</importSettings>, чтобы загрузить изменения.

# export_settings_modified_settings
source: Flutter VK settings
ru: Настройки Flutter VK

# export_settings_modified_settings_desc
source: {count, plural, one{{count} setting} other{{count} settings}} changed
ru: Изменен{count, plural, one{а {count} настройка} few{о {count} настройки} other{о {count} настроек}}

# export_settings_modified_thumbnails
source: Changed track covers
ru: Изменённые обложки треков

# export_settings_modified_thumbnails_desc
source: {count, plural, one{{count} cover} other{{count} covers}} changed using the <colored><icon></icon> Change cover</colored> option
ru: Опцией <colored><icon></icon> Заменить обложку</colored> было изменен{count, plural, one{а {count} обложка} few{о {count} обложки} other{о {count} обложек}}

# export_settings_modified_lyrics
source: Changed lyrics
ru: Изменённые тексты песен

# export_settings_modified_lyrics_desc
source: {count, plural, one{{count} lyric} other{{count} lyrics}} changed
ru: Измен{count, plural, one{ён {count} текст песни} few{ено {count} текста песен} other{ено {count} текстов песен}}

# export_settings_modified_metadata
source: Changed track metadata
ru: Изменённые параметры треков

# export_settings_modified_metadata_desc
source: {count, plural, one{{count} track} other{{count} tracks}} changed
ru: Измен{count, plural, one{ён {count} трек} few{ено {count} трека} other{ено {count} треков}}

# export_settings_downloaded_restricted
source: Downloaded but restricted tracks
ru: Загруженные, но ограниченные треки

# export_settings_downloaded_restricted_desc
source: {count, plural, one{{count} track} other{{count} tracks}} available for listening despite restricted access due to caching
ru: {count, plural, one{{count} трек доступен} few{{count} трека доступно} other{{count} треков доступно}} для прослушивания несмотря на ограниченный доступ благодаря скачиванию

# export_settings_locally_replaced
source: Locally replaced tracks
ru: Локально заменённые треки

# export_settings_locally_replaced_desc
source: {count, plural, one{{count} track} other{{count} tracks}} replaced using the <colored><icon></icon> Local track replacement</colored> option
ru: Замен{count, plural, one{ён {count} трек} few{ено {count} трека} other{ено {count} .mp3-файлов треков}} при помощи <colored><icon></icon> Локальной замены трека</colored>

# export_settings_export
source: Export
ru: Экспортировать

# export_settings_success
source: Export completed
ru: Экспорт завершён

# export_settings_success_desc
source: Export completed successfully! Manually transfer the file to another device and use the "import settings" option to restore the changes.
ru: Экспорт завершён успешно! Вручную перенесите файл на другое устройство и воспользуйтесь опцией «импорт настроек» что бы восстановить изменения.

# copy_to_downloads_success
source: The file was successfully copied to the "Downloads" folder.
ru: Файл был успешно скопирован в папку «Загрузки».

# settings_import
source: Import settings
ru: Импорт настроек

# settings_import_tip
source: About settings import
ru: Об импорте настроек

# settings_import_tip_desc
source: Settings import is a feature that synchronizes Flutter VK app settings and track changes made on another device. Not sure where to start? Refer to the <exportSettings><exportSettingsIcon></exportSettingsIcon> Export settings</exportSettings> feature.
ru: Импорт настроек — функций, синхронизирующая настройки приложения Flutter VK а так же изменения треков, совершённые на другом устройстве. Не понимаете с чего начать? Обратитесь к функции <exportSettings><exportSettingsIcon></exportSettingsIcon> Экспорт настроек</exportSettings>.

# settings_import_select_file
source: No file selected for settings import.
ru: Файл для импорта настроек не выбран.

# settings_import_select_file_dialog_title
source: Select a file for settings and tracks import
ru: Выберите файл для импорта настроек и треков

# settings_import_version_missmatch
source: Compatibility issue
ru: Проблема совместимости

# settings_import_version_missmatch_desc
source: This file was created in a previous version of Flutter VK (v{version}), which may cause issues with the import. Are you sure you want to continue?
ru: Этот файл был создан в предыдущей версии Flutter VK (v{version}), ввиду чего могут быть проблемы с импортом. Уверены, что хотите продолжить?

# settings_import_import
source: Import
ru: Импортировать

# settings_import_success
source: Settings import successful
ru: Импорт настроек успешен

# settings_import_success_desc_with_delete
source: Settings and tracks import completed successfully. You may need to restart the app for some settings to be saved and applied. After import, the export file is no longer needed. Do you want to delete it?
ru: Импорт настроек и треков был завершён успешно. Возможно, Вам понадобится перезагрузить приложение, что бы некоторые из настроек успешно сохранились и применились. После импорта, файл экспорта уже не нужен. Хотите удалить его?

# settings_import_success_desc_no_delete
source: Settings and tracks import completed successfully. You may need to restart the app for some settings to be saved and applied.
ru: Импорт настроек и треков был завершён успешно. Возможно, Вам понадобится перезагрузить приложение, что бы некоторые из настроек успешно сохранились и применились.

# reset_db
source: Reset track database
ru: Сбросить базу треков

# reset_db_desc
source: Clears the local copy of the track database stored on this device
ru: Очищает локальную копию базы данных треков, хранимую на этом устройстве

# reset_db_dialog
source: Reset track database
ru: Сброс базы данных треков

# reset_db_dialog_desc
source: Continuing will delete the track database stored on this device. Please do not do this unless absolutely necessary. Your tracks (both liked and downloaded) will not be deleted, but you will need to restart the caching process on previously downloaded playlists.
ru: Продолжив, Flutter VK удалит базу данных треков, хранимую на этом устройстве. Пожалуйста, не делайте этого без острой необходимости. Ваши треки (как лайкнутые, так и загруженные) не будут удалены, однако Вам придётся по-новой запустить процесс загрузки на ранее загруженных плейлистах.

# app_updates_policy
source: Updates display type
ru: Вид новых обновлений

# app_updates_policy_desc
source: Determines how the app will notify you about new updates
ru: Определяет то, как приложение будет раздражать Вас, напоминая о новом обновлении

# app_updates_policy_dialog
source: Dialog
ru: Диалог

# app_updates_policy_popup
source: Bottom popup
ru: Надпись снизу

# app_updates_policy_disabled
source: Disabled
ru: Отключено

# disable_updates_warning
source: Disable app updates
ru: Отключение обновлений

# disable_updates_warning_desc
source: It looks like you are trying to disable app updates. This is not recommended as future versions may fix bugs and add new features. If you are annoyed by the fullscreen dialog, try changing this setting to "Bottom popup": This option will not interfere with your usage.
ru: Похоже, что Вы пытаетесь отключить обновления приложения. Делать это не рекомендуется, поскольку в будущих версиях могут быть исправлены баги, а так же могут добавляться новые функции. Если Вас раздражает полноэкранный диалог, мешающий пользованию приложения, то попробуйте поменять эту настройку на значение "Надпись снизу": Такой вариант не будет мешать Вам.

# disable_updates_warning_disable
source: Disable anyway
ru: Всё равно отключить

# updates_are_disabled
source: App updates are disabled. You can check for updates manually by clicking the "About the app" button on the profile page.
ru: Обновления приложения отключены. Вы можете проверять на наличие обновлений вручную, нажав на кнопку "О приложении" на странице профиля.

source: Updates channel
ru: Канал обновлений

# updates_channel_desc
source: The beta channel has more frequent but less stable builds
ru: Бета-канал имеет более частые, но менее стабильные билды

# updates_channel_releases
source: Main (default)
ru: Основные (по-умолчанию)

# updates_channel_prereleases
source: Beta
ru: Бета

# share_logs
source: Share log file
ru: Поделиться файлом логов

# share_logs_desc
source: Technical information for debugging errors
ru: Техническая информация для отладки ошибок

# share_logs_desc_no_logs
source: Unavailable because the log file is empty
ru: Недоступно, поскольку файл логов пуст

source: About Flutter VK
ru: О Flutter VK

# app_telegram
source: Telegram channel
ru: Telegram-канал

# app_telegram_desc
source: Clicking here will open Telegram channel with CI builds and other information
ru: Откроет Telegram-канал с CI-билдами, а так же информацией о разработке приложения

# app_github
source: Source code
ru: Исходный код проекта

# app_github_desc
source: Click here to visit the Github repository of Flutter VK
ru: Нажав сюда, мы отправим Вас в прекрасный Github-репозиторий приложения Flutter VK

# show_changelog
source: Changelog
ru: Список изменений

# show_changelog_desc
source: Shows the changelog for this version
ru: Показывает список изменений в этой версии приложения

# changelog_dialog
source: Changelog for {version}
ru: Список изменений в {version}

# app_version
source: About the app
ru: О приложении

# app_version_desc
source: Installed version: {version}. Click here to check for new updates
ru: Установленная версия приложения: {version}. Нажмите сюда, чтобы проверить на наличие новых обновлений

# app_version_prerelease
source: beta
ru: бета

# download_manager_current_tasks
source: Currently downloading
ru: Загружаются сейчас

# download_manager_old_tasks
source: Previously downloaded
ru: Загружено ранее

# download_manager_all_tasks
source: {count, plural, one{{count} task} other{{count} tasks}} total
ru: {count, plural, one{{count} задача} few{{count} задачи} other{{count} задач}} всего

# download_manager_no_tasks
source: Empty...
ru: Пусто...

# update_available
source: Flutter VK update available
ru: Доступно обновление Flutter VK

# update_prerelease_type
source: <debug></debug> beta
ru: <debug></debug> бета

# app_update_download_long_title
source: Flutter VK update v{version}
ru: Обновление Flutter VK v{version}

# update_available_popup
source: Flutter VK update {version} available.
ru: Доступно обновление Flutter VK до версии {version}.

# update_check_error
source: Error checking for updates: {error}
ru: Ошибка при проверке на наличие обновлений: {error}

# update_pending
source: Update download started. Wait for the download to complete, then follow the instructions.
ru: Загрузка обновления начата. Дождитесь окончания загрузки, затем проследуйте инструкциям.

# update_install_error
source: Update installation error
ru: Ошибка при установке обновления

# no_updates_available
source: The latest version of the app is installed.
ru: Установлена актуальная версия приложения.
