Repository: Zensonaton/FlutterVK
Catalog: lib/l10n/app_*.arb
Languages: ru

# general_yes
source: Yes
ru: Да

# general_no
source: No
ru: Нет

# general_save
source: Save
ru: Сохранить

# general_reset
source: Reset
ru: Сбросить

# general_cancel
source: Cancel
ru: Отменить

# general_close
source: Close
ru: Закрыть

# general_loading
source: Loading...
ru: Загрузка...

# general_restore
source: Restore
ru: Вернуть

# general_continue
source: Continue
ru: Продолжить

# general_shuffle
source: Shuffle
ru: Перемешать

# general_play
source: Play
ru: Воспроизвести

# general_pause
source: Pause
ru: Пауза

# general_resume
source: Resume
ru: Продолжить

# general_enable
source: Enable
ru: Включить

# general_edit
source: Edit
ru: Редактировать

# general_logout
source: Logout
ru: Выход

# general_exit
source: Exit
ru: Выйти

# general_title
source: Title
ru: Название

# general_artist
source: Artist
ru: Исполнитель

# general_genre
source: Genre
ru: Жанр

# general_share
source: Share
ru: Поделиться

# general_nothing_found
source: Nothing found
ru: Ничего не найдено

# general_copy_to_downloads
source: Copy to "Downloads"
ru: Скопировать в «Загрузки»

# general_open_folder
source: Open folder
ru: Открыть папку

# general_select
source: Select
ru: Выбрать

# general_details
source: Details
ru: Подробности

# general_install
source: Install
ru: Установить

# general_show
source: Show
ru: Показать

# general_filesize_mb
source: {value} MB
ru: {value} МБ

# general_filesize_gb
source: {value} GB
ru: {value} ГБ

# general_favorites_playlist
source: Favorites
ru: Любимая музыка

# general_search_playlist
source: Search audios
ru: Музыка из результатов поиска

# general_owned_playlist
source: Your playlist
ru: Ваш плейлист

# general_saved_playlist
source: Saved playlist
ru: Сохранённый плейлист

# general_recommended_playlist
source: Recommended playlist
ru: Рекомендуемый плейлист

# general_audios_count
source: {count, plural, one{{count} audio} other{{count} audios}}
ru: {count, plural, one{{count} трек} few{{count} трека} other{{count} треков}}

# dislike_track_action
source: Dislike
ru: Не нравится

# enable_shuffle_action
source: Enable shuffle
ru: Включить перемешку

# disable_shuffle_action
source: Disable shuffle
ru: Выключить перемешку

# previous_track_action
source: Previous
ru: Предыдущий

# play_track_action
source: Play
ru: Воспроизвести

# pause_track_action
source: Pause
ru: Пауза

# next_track_action
source: Next
ru: Следующий

# enable_repeat_action
source: Enable repeat
ru: Включить повтор

# disable_repeat_action
source: Disable repeat
ru: Выключить повтор

# favorite_track_action
source: Like
ru: Нравится

# remove_favorite_track_action
source: Dislike
ru: Не нравится

# not_yet_implemented
source: Not implemented yet
ru: Не реализовано

# not_yet_implemented_desc
source: This feature has not been implemented yet.
ru: Данный функционал ещё не был реализован. Пожалуйста, ожидайте обновлений приложения в будущем!

# error_dialog
source: An error occurred
ru: Произошла ошибка

# error_dialog_desc
source: Something went wrong. And I''m sorry about that. Try again later.
ru: Что-то очень сильно пошло не так. Что-то поломалось. Всё очень плохо.

# player_playback_error
source: Playback error: {error}
ru: Ошибка воспроизведения: {error}

# player_playback_error_stopped
source: Playback stopped due to excessive errors: {error}
ru: Воспроизведение остановлено ввиду большого количества ошибок: {error}

source: Track added to queue.
ru: Трек добавлен в очередь.

# app_restart_required
source: Restart the application to apply changes.
ru: Пожалуйста, перезагрузите приложение.

# option_unavailable_with_light_theme
source: This option is unavailable because app is used in light theme.
ru: Эта опция недоступна, поскольку сейчас используется светлая тема.

# option_unavailable_without_recommendations
source: This setting is unavailable you haven''t connected VK recommendations.
ru: Настройка недоступна, поскольку у Вас не подключены рекомендации ВКонтакте.

# option_unavailable_without_audio_playing
source: You will not be able to see changes to this settings, because no audio is playing right now.
ru: Изменения данной настройки не будут видны сейчас, поскольку Вы не запустили воспроизведение музыки.

# thumbnails_unavailable_without_recommendations
source: Thumbnails aren''t shown because you haven''t connected VK recommendations.
ru: Вы не видите обложек треков, поскольку у Вас не подключены рекомендации ВКонтакте.

# app_minimized_message
source: Flutter VK minimized. Use the tray or reopen the app to restore the window.
ru: Flutter VK свернулся. Воспользуйтесь треем или откройте приложение ещё раз, чтобы вернуть окошко.

# tray_show_hide
source: Show/Hide
ru: Открыть/Свернуть

# music_readme_contents
source: Hey-hey-hey! Stop right there! 🤚 Yes, this folder contains tracks downloaded by the Flutter VK app. If you noticed, these tracks are saved in a very unusual format, and there's a reason for that. I, the app developer, don't want users (like you!) to easily access these tracks. If you try hard enough, you'll eventually find the track you need. However, I'd prefer you didn't. If it turns out that someone is using the app to download tracks, I'll have to add additional levels of obfuscation or encryption, like AES. Please respect the work of the artists who put a lot of time into creating their tracks. Distributing them this way causes them serious harm. If you still decide to distribute the tracks as .mp3 files, at least do it without any profit, only for personal use. Thanks for your attention, fren :)
ru: Хей-хей-хей! А ну, постой! 🤚 Да, в этой папке хранятся загруженные приложением «Flutter VK» треки. Если ты обратил внимание, эти треки сохранены в очень необычном формате, и на то есть причина. Я, разработчик приложения, не хочу, чтобы пользователи (вроде тебя!) могли легко получить доступ к этим трекам. Если ты сильно постараешься, рано или поздно найдешь нужный трек. Однако я бы предпочел, чтобы ты этого не делал. Если выяснится, что кто-то использует приложение для загрузки треков, мне придется добавить дополнительные уровни обфускации или шифрования, вроде AES. Пожалуйста, уважай труд исполнителей, которые вкладывают много времени в создание своих треков. Распространяя их таким образом, ты наносишь им серьёзный вред. Если ты все же решишь распространять треки в виде .mp3-файлов, то, по крайней мере, делай это без корыстных целей, только для личного использования. Спасибо за внимание, fren :)

# internet_required_title
source: No Connection
ru: Нет подключения

# internet_required_desc
source: This action can only be performed when connected to the internet. Please connect to a network and try again.
ru: Данное действие можно выполнить лишь при подключении к интернету. Пожалуйста, подключитесь к сети и попробуйте ещё раз.

# demo_mode_enabled_title
source: Unavailable in demo mode
ru: Недоступно в демо-версии

# demo_mode_enabled_desc
source: This feature is not available in demo mode of Flutter VK. Head to the "profile" to download full version on your device.
ru: Данный функционал недоступен в демо-версии Flutter VK. Вы можете загрузить полноценную версию приложение, перейдя в «профиль».

# prerelease_app_version_warning
source: Beta Version
ru: Бета-версия

# prerelease_app_version_warning_desc
source: Shhhh! Here be dragons! You''ve stepped into dangerous territory by installing the beta version of Flutter VK. Beta versions are less stable and not recommended for regular users. By continuing, you acknowledge the risks of using the beta version of the app. This notification will only be shown once.
ru: Тс-с-с! Вы ступили на опасную территорию, установив бета-версию Flutter VK. Бета-версии менее стабильны, и обычным пользователям устанавливать их не рекомендуется. Продолжая, Вы осознаёте риски использования бета-версии приложения, в ином случае Вас может скушать дракоша. Данное уведомление будет показано только один раз.

# demo_mode_welcome_warning
source: Demo mode
ru: Демо-версия

# demo_mode_welcome_warning_desc
source: Welcome to demo mode of Flutter VK! This app version is limited and there are performance and stability issues. Head to the "profile" to download full version on your device.
ru: Добро пожаловать в демо-версию Flutter VK! Здесь вы можете ознакомиться с основными возможностями приложения. В полной версии будут доступны: авторизация во ВКонтакте, прослушивание рекомендаций, скачивание плейлистов и многое другое. Для загрузки полной версии перейдите в «профиль».

# welcome_title
source: Welcome! 😎
ru: Добро пожаловать! 😎

# welcome_desc
source: <bold>Flutter VK</bold> is an experimental unofficial VK client built using the Flutter framework with <link>open source code</link> for listening to music without needing a VK BOOM subscription.
ru: <bold>Flutter VK</bold> — это экспериментальный неофициальный клиент ВКонтакте, построенный при помощи фреймворка Flutter с <link>открытым исходным кодом</link> для прослушивания музыки без необходимости приобретать подписку VK BOOM.

# login_title
source: Authorization
ru: Авторизация

# login_desktop_desc
source: To authorize, <link>🔗 follow the link</link> and grant the app access to your VK account. After clicking allow, copy the website address from the browser''s address bar and paste it into the field below:
ru: Для авторизации <link>🔗 перейдите по ссылке</link> и предоставьте приложению доступ к аккаунту ВКонтакте. Нажав на «разрешить», скопируйте адрес сайта из адресной строки браузера и вставьте в поле ниже:

# login_connect_recommendations_title
source: Connect Recommendations
ru: Подключение рекомендаций

# login_connect_recommendations_desc
source: To connect recommendations, <link>🔗 follow the link</link> and grant the app access to your VK account. After clicking allow, copy the website address from the browser''s address bar and paste it into the field below:
ru: Для подключения рекомендаций <link>🔗 перейдите по ссылке</link> и предоставьте приложению доступ к аккаунту ВКонтакте. Нажав на «разрешить», скопируйте адрес сайта из адресной строки браузера и вставьте в поле ниже:

# login_authorize
source: Authorize
ru: Авторизоваться

# login_mobile_alternate_auth
source: Alternate Authorization Method
ru: Альтернативный метод авторизации

# login_no_token_error
source: Access token was not found in the provided link.
ru: Access-токен не был найден в переданной ссылке.

# login_no_music_access_desc
source: Flutter VK couldn''t access the special music sections needed for the app to function. This error usually occurs if you mistakenly tried to authorize using the Kate Mobile app instead of the VK Admin app. Please carefully follow the authorization instructions and try again.
ru: Flutter VK не смог получить доступ к специальным разделам музыки, необходимых для функционирования приложения. Чаще всего, такая ошибка происходит в случае, если Вы по-ошибке попытались авторизоваться при помощи приложения Kate Mobile вместо приложения VK Admin. Пожалуйста, внимательно проследуйте инструкциям для авторизации, и попробуйте снова.

# login_wrong_user_id
source: Flutter VK detected that you connected a different VK page than the one currently connected. Please log in as {name} on VK and try again.
ru: Flutter VK обнаружил, что Вы подключили другую страницу ВКонтакте, которая отличается от той, которая подключена сейчас. Пожалуйста, авторизуйтесь как {name} во ВКонтакте и попробуйте снова.

# login_success_auth
source: Authorization successful!
ru: Авторизация успешна!

# music_label
source: Music
ru: Музыка

# music_label_offline
source: Music (offline)
ru: Музыка (оффлайн)

# music_library_label
source: Library
ru: Библиотека

# profile_label
source: Profile
ru: Профиль

# profile_labelOffline
source: Profile (offline)
ru: Профиль (оффлайн)

# downloads_label
source: Downloads
ru: Загрузки

# downloads_label_offline
source: Downloads (offline)
ru: Загрузки (оффлайн)

# music_welcome_title
source: Welcome, {name}! 👋
ru: Добро пожаловать, {name}! 👋

# category_closed
source: You closed the '{category}' section. You can restore it by clicking the button in 'active sections'.
ru: Вы закрыли раздел «{category}». Вы можете вернуть его, нажав на кнопку в «активных разделах».

# my_music_chip
source: My Music
ru: Моя музыка

# my_playlists_chip
source: Your Playlists
ru: Ваши плейлисты

# realtime_playlists_chip
source: In Real Time
ru: В реальном времени

# recommended_playlists_chip
source: Playlists for You
ru: Плейлисты для Вас

# simillar_music_chip
source: Taste Matches
ru: Совпадения по вкусам

# by_vk_chip
source: Curated by VK
ru: Собрано редакцией

# connect_recommendations_chip
source: Connect VK Recommendations
ru: Подключить рекомендации ВКонтакте

# connect_recommendations_title
source: Connect Recommendations
ru: Подключение рекомендаций

# connect_recommendations_desc
source: By connecting recommendations, you''ll gain access to music sections like "Playlists for You", "VK Mix", and you''ll also get access to track covers. To connect recommendations, you''ll need to authorize again via VK.
ru: Подключив рекомендации, Вы получите доступ к разделам музыки «Плейлисты для Вас», «VK Mix» и другие, а так же Вы начнёте видеть обложки треков. Для подключения рекомендаций, Вам будет необходимо повторно авторизоваться.

source: All Tracks
ru: Все треки

# track_unavailable_offline_title
source: Track unavailable offline
ru: Трек недоступен оффлайн

# track_unavailable_offline_desc
source: You cannot listen to this track offline because you did not downloaded it earlier.
ru: Вы не можете прослушать данный трек в оффлайн-режиме, поскольку Вы не загрузили его ранее.

# track_restricted_title
source: Audio unavailable
ru: Аудиозапись недоступна

# track_restricted_desc
source: VK reported that this audio is unavailable. This decision was likely made by the track artist or label. Since you haven''t downloaded this track earlier, playback is impossible.
ru: Сервера ВКонтакте сообщили, что эта аудиозапись недоступна. Вероятнее всего, так решил исполнитель трека либо его лейбл. Поскольку Вы не загрузили этот трек ранее, воспроизведение невозможно. Воспользуйтесь опцией «локальная замена трека» при наличии загруженного аудио в формате .mp3.

# search_tracks_in_playlist
source: Search among {count, plural, one{{count} track} other{{count} tracks}} here
ru: Поиск среди {count, plural, one{{count} трека} other{{count} треков}} здесь

# playlist_is_empty
source: This playlist is empty.
ru: В данном плейлисте пусто.

# playlist_search_zero_results
source: No results found for your query. Try <click>clearing your query</click>.
ru: По Вашему запросу ничего не найдено. Попробуйте <click>очистить свой запрос</click>.

# enable_download_title
source: Enable track downloading
ru: Включение загрузки треков

# enable_download_desc
source: By enabling this feature, Flutter VK will automatically download all tracks in this playlist, making them available for offline listening. If you continue, Flutter VK will download {count, plural, one{{count} track} other{{count} tracks}}, that''ll take ~{downloadSize} of internet traffic.
ru: Включив загрузку треков, Flutter VK будет автоматически загружать все треки в данном плейлисте, делая их доступных для прослушивания даже оффлайн, а так же после удаления правообладателем. Продолжив, будет {count, plural, one{загружен {count} трек} few{загружено {count} трека} other{загружено {count} треков}}, что потребует ~{downloadSize} интернет трафика. Пожалуйста, не запускайте этот процесс, если у Вас лимитированный интернет.

# disable_download_title
source: Delete downloaded tracks
ru: Удаление загруженных треков

# disable_download_desc
source: You will remove {count, plural, one{{count} saved track} other{{count} saved tracks}} which are taking up {size} on your device. After removal, you will not be able to listen to this playlist offline. Are you sure you want to continue?
ru: Очистив загруженные треки этого плейлиста, Flutter VK удалит из памяти {count, plural, one{{count} сохранённый трек} few{{count} сохранённых трека} other{{count} сохранённых треков}}, что занимает {size} на Вашем устройстве. После удаления Вы не сможете слушать данный плейлист оффлайн. Уверены, что хотите продолжить?

# stop_downloading_button
source: Stop
ru: Остановить

# delete_downloaded_button
source: Delete
ru: Удалить

# playlist_downloading
source: Downloading playlist "{title}"
ru: Загрузка плейлиста «{title}»

# playlist_download_removal
source: Removing tracks from playlist "{title}"
ru: Удаление треков плейлиста «{title}»

# search_music_global
source: Search VK music
ru: Поиск музыки ВКонтакте

# type_to_search
source: Enter the song title above to start searching.
ru: Введите название песни сверху чтобы начать поиск.

# audio_restore_too_late_desc
source: The track cannot be restored because too much time has passed since its deletion. Use the search to find this track and add it again.
ru: Трек не может быть восстановлен, поскольку прошло немало времени с момента его удаления. Воспользуйтесь поиском, чтобы найти этот трек и добавить снова.

# add_track_as_liked
source: Mark as liked
ru: Добавить как «любимый» трек

# remove_track_as_liked
source: Remove from liked
ru: Удалить из «любимых» треков

# add_track_to_playlist
source: Add to playlist
ru: Добавить в плейлист

# play_track_next
source: Play next
ru: Сыграть следующим

# go_to_track_album
source: Go to album
ru: Перейти к альбому

# go_to_track_album_desc
source: Opens the album page "{title}"
ru: Откроет страницу альбома «{title}»

# search_track_on_genius
source: Search on Genius
ru: Поиск по Genius

# search_track_on_genius_desc
source: Track lyrics and other information from Genius
ru: Текст песни, и прочая информация с Genius

# download_this_track
source: Download
ru: Загрузить

# download_this_track_desc
source: Allows you to listen to the track even without an internet connection
ru: Позволяет прослушать трек даже без подключения к интернету

# change_track_thumbnail
source: Change cover
ru: Заменить обложку

# change_track_thumbnail_desc
source: Sets the cover by searching from Deezer
ru: Устанавливает обложку, выполняя поиск с сервиса Deezer

# reupload_track_from_youtube
source: Reupload from YouTube
ru: Перезалить с Youtube

# reupload_track_from_youtube_desc
source: Locally replaces this audio with a version from YouTube
ru: Локально заменяет этот трек на версию с Youtube

# replace_track_with_local
source: Replace with local audio
ru: Локальная замена трека

# replace_track_with_local_desc
source: Locally replaces this audio with another one downloaded on your device
ru: Локально заменяет это аудио на другое, загруженное на Вашем устройстве

# replace_track_with_local_filepicker_title
source: Select a track for replacement
ru: Выберите трек для замены

# replace_track_with_local_success
source: The track was successfully replaced on this device.
ru: Трек был успешно заменён на этом устройстве.

source: Remove local track version
ru: Удалить локальную версию трека

# remove_local_track_success
source: The track was successfully restored.
ru: Трек был успешно восстановлен.

# remove_local_track_is_restricted_title
source: Track is restricted
ru: Трек ограничен

# remove_local_track_is_restricted_desc
source: This track is unavailable for playback. Continuing will remove this track from your device, and you will no longer be able to listen to it here. Are you sure you want to lose access to this track?
ru: Данный трек недоступен для прослушивания со стороны ВКонтакте, поскольку так решил его исполнитель. Продолжив, Вы удалите этот трек со своего устройства, и более Вы не сможете его прослушивать здесь. Вы уверены, что хотите потерять доступ к этому треку?

source: Track details
ru: Детали трека

# change_track_thumbnail_search_text
source: Deezer query
ru: Запрос для Deezer

# change_track_thumbnail_type_to_search
source: Enter the track title above to search for covers.
ru: Введите название трека сверху, чтобы выполнить поиск по обложкам.

# icon_tooltip_downloaded
source: Downloaded
ru: Загружен

# icon_tooltip_replaced_locally
source: Replaced locally
ru: Заменён локально

# icon_tooltip_restricted
source: Unavailable
ru: Недоступен

# icon_tooltip_restricted_playable
source: Restricted but playable
ru: Ограничен с возможностью воспроизведения

# track_info_edit_error_restricted
source: You cannot edit this track because it is an official release.
ru: Вы не можете отредактировать данный трек, поскольку это официальный релиз.

# track_info_edit_error
source: An error occurred while editing the track: {error}
ru: Произошла ошибка при редактировании трека: {error}

# all_blocks_disabled
source: Woah! It looks like there is nothing here.
ru: Ой! Похоже, тут ничего нет.

# all_blocks_disabled_desc
source: Turn something on by clicking the desired switch above.
ru: Соскучились по музыке? Включите что-то, нажав на нужный переключатель сверху.

# simillarity_percent
source: <bold>{simillarity}%</bold> match with you
ru: <bold>{simillarity}%</bold> совпадения с Вами

# fullscreen_no_audio
source: <bold>Sshhhh, don''t wake up the doggo</bold>! You have nothing playing right now. Click <exit>here</exit> to close the player.
ru: <bold>Тс-с-с, тишину! Собачка спит!</bold> Плеер сейчас ничего не воспроизводит. Нажмите <exit>сюда</exit>, чтобы закрыть этот экран.

# logout_desc
source: Are you sure you want to log out of the {name} account in the Flutter VK app?
ru: Вы уверены, что хотите выйти из аккаунта {name} приложения Flutter VK?

# no_recommendations_warning
source: Recommendations are not connected
ru: Рекомендации ВКонтакте не подключены

# no_recommendations_warning_desc
source: Connected Recommendations give you access to curated by VK playlists with new tracks, and ability to see audio thumbnails. Tap here to connect Recommendations and fix this.
ru: Из-за этого у треков нет обложек, а так же Вы теряете доступ к "умным" плейлистам с новыми треками. Нажмите на это поле, чтобы подключить рекомендации и исправить это.

# demo_mode_warning
source: You are running in demo mode
ru: Запущена демо-версия Flutter VK

# demo_mode_warning_desc
source: Because of this, some features may be disabled or not work correctly. Tap here to install full version of Flutter VK on your device.
ru: Из-за этого отключена огромная часть функционала, не работает авторизация, есть проблемы с производительностью и стабильностью. Нажмите на это поле, чтобы загрузить полноценную версию приложения на Ваше устройство.

# player_queue_header
source: Playing music from
ru: Воспроизведение плейлиста

# player_lyrics_header
source: Lyrics source
ru: Источник текста песни

# lyrics_vk_source
source: VK
ru: ВКонтакте

# visual_settings
source: Visual & cosmetic settings
ru: Визуал, косметические настройки

# app_theme
source: Theme
ru: Тема

# app_theme_desc
source: The dark theme makes the UI more pleasant for use, especially at night or dark environments. Additionally, you can enable the OLED theme, which makes the app background as black as possible to save battery on some devices.
ru: Тёмная тема делает интерфейс более приятным для глаз, особенно при использовании в тёмное время суток. Дополнительно, Вы можете включить OLED-тему, что сделает фон приложения максимально чёрным для экономии заряда батареи на некоторых устройствах.

# app_theme_system
source: System
ru: Системная

# app_theme_light
source: Light
ru: Светлая

# app_theme_dark
source: Dark
ru: Тёмная

source: OLED theme
ru: OLED-тема

# oled_theme_desc
source: With the OLED theme, a truly black color will be used for the background. This can save battery on some devices.
ru: При OLED-теме будет использоваться по-настоящему чёрный цвет для фона. Это может сэкономить заряд батареи на некоторых устройствах.

# enable_oled_theme
source: Use OLED theme
ru: Использовать OLED-тему

# use_player_colors_appwide
source: Track colors app-wide
ru: Цвета трека по всему приложению
